chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
            /* Try to reinitialize PHY if we can't read it */
            static int phy_error_count = 0;
            phy_error_count++;
            if (phy_error_count >= 10) {  /* After 10 consecutive errors (5 seconds) */
                printf("[LINK_MONITOR] Attempting PHY re-initialization\r\n");
                hw_eth_phy_init(&eth_communication);
                phy_error_count = 0;
            }
        }
        
        /* Check link status every 500ms */
        vTaskDelay(500);
    }
}

/* TCP/IP stack initialization done callback - moved from webserver_tasks.c */
static void eth_tcpip_init_done(void *arg)
{
    sys_sem_t *sem;
    sem = (sys_sem_t *)arg;
    u8_t mac[6] = {0x00, 0x00, 0x00, 0x00, 0x20, 0x76};
    
    /* Initialize network event logging */
    network_events_init();
    log_lwip_init(ERR_OK);
    
    hw_eth_register_callback(&eth_communication, DRV_ETH_CB_RECEIVE, gmac_handler_cb);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)eth_communication.hw_context;
    hri_gmac_set_IMR_RCOMP_bit(context->mac_desc->dev.hw);

    printf("[INIT] Waiting for Ethernet link...\r\n");
    
    /* Initialize PHY before reading its status */
    drv_eth_status_t phy_init_status = hw_eth_phy_init(&eth_communication);
    if (phy_init_status != DRV_ETH_STATUS_OK) {
        printf("[INIT] PHY initialization failed: %d\r\n", phy_init_status);
    }
    
    /* Give PHY more time to initialize and establish link */
    int link_attempts = 0;
    const int max_link_attempts = 100;  /* 10 seconds at 100ms intervals */
    
    while (link_attempts < max_link_attempts) {
        drv_eth_status_t phy_status = hw_eth_get_link_status(&eth_communication, &context->link_up);
        
        if (phy_status == DRV_ETH_STATUS_OK && context->link_up) {
            printf("[INIT] PHY link established after %d attempts\r\n", link_attempts);
            break;
        }
        
        if (phy_status != DRV_ETH_STATUS_OK) {
            printf("[INIT] PHY read error: %d (attempt %d)\r\n", phy_status, link_attempts);
        } else {
            printf("[INIT] PHY link still down (attempt %d)\r\n", link_attempts);
        }
        
        link_attempts++;
        vTaskDelay(100);  /* Wait 100ms between attempts */
    }
    
    if (!context->link_up) {
        printf("[INIT] WARNING: PHY link not established after %d attempts\r\n", max_link_attempts);
        printf("[INIT] Continuing with network stack initialization...\r\n");
    }

    printf("[INIT] Ethernet link detected\r\n");

    /* Enable NVIC GMAC interrupt. */
    /* Interrupt priorities. (lowest value = highest priority) */
    /* ISRs using FreeRTOS *FromISR APIs must have priorities below or equal to */
    /* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY. */
    /* Setting to 5 (numerically higher than 4, so lower priority) */
    NVIC_SetPriority(GMAC_IRQn, 5);
    NVIC_EnableIRQ(GMAC_IRQn);
    mac_async_enable(context->mac_desc);

    printf("[INIT] Initializing network interface using new GMAC LWIP interface...\r\n");
    // Network interface initialization is now handled by eth_ipstack_main.c
    // which will call either ethif_gmac_init or ethif_ksz8851snl_init based on build config

    TCPIP_STACK_INTERFACE_0_desc.input = tcpip_input;

    context->gmac_dev.netif = &TCPIP_STACK_INTERFACE_0_desc;

    /* Incoming packet notification semaphore. */
    if (sys_sem_new(&context->gmac_dev.rx_sem, 0) != ERR_OK) {
        LWIP_ASSERT("Failed to create semaphore", 0);
    }

    sys_thread_t id = sys_thread_new("GMAC", gmac_task, &context->gmac_dev, netifINTERFACE_TASK_STACK_SIZE, netifINTERFACE_TASK_PRIORITY);
    LWIP_ASSERT("ethernetif_init: GMAC Task allocation ERROR!\n", (id != 0));
    (void)id;  /* Suppress unused variable warning after assertion */

    printf("[INIT] Setting up network interface callbacks...\r\n");
    netif_set_default(&TCPIP_STACK_INTERFACE_0_desc);
    
    /* Register network event callbacks */
    netif_set_status_callback(&TCPIP_STACK_INTERFACE_0_desc, netif_status_callback);
    netif_set_link_callback(&TCPIP_STACK_INTERFACE_0_desc, netif_link_callback);
    
    /* Log initial MAC address */
    log_mac_address(&TCPIP_STACK_INTERFACE_0_desc);
    
    /* Log initial link status */
    log_link_status_change(&TCPIP_STACK_INTERFACE_0_desc, context->link_up);
    
    /* Manually update lwIP link status since link monitoring task hasn't started yet */
    if (context->link_up) {
        printf("[INIT] Setting initial link status to UP in lwIP\r\n");
        netif_set_link_up(&TCPIP_STACK_INTERFACE_0_desc);
    } else {
        printf("[INIT] Setting initial link status to DOWN in lwIP\r\n");
        netif_set_link_down(&TCPIP_STACK_INTERFACE_0_desc);
    }

#if CONF_TCPIP_STACK_INTERFACE_0_DHCP
    /* DHCP mode. */
    printf("[INIT] Starting DHCP client...\r\n");
    if (ERR_OK != dhcp_start(&TCPIP_STACK_INTERFACE_0_desc)) {
        log_dhcp_error(&TCPIP_STACK_INTERFACE_0_desc, "Failed to start DHCP client");
        LWIP_ASSERT("ERR_OK != dhcp_start", 0);
    } else {
        printf("[DHCP] Client started successfully\r\n");
    }
#else
    printf("[INIT] Using static IP configuration...\r\n");
    netif_set_up(&TCPIP_STACK_INTERFACE_0_desc);
    log_network_config(&TCPIP_STACK_INTERFACE_0_desc);
#endif

    printf("[INIT] Network initialization complete\r\n");
    sys_sem_signal(sem); /* Signal the waiting thread that the TCP/IP init is done. */
}

static drv_eth_tcpip_init_done_fn drv_eth_get_tcpip_init_done_fn_impl(const void *hw_context)
{
    return eth_tcpip_init_done;
}

/**
 * \brief Start link monitoring task
 */
static drv_eth_status_t drv_eth_start_link_monitor_impl(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    if (context->link_monitor_task != NULL) {
        printf("[ETH] Link monitor task already running\r\n");
        return DRV_ETH_STATUS_OK;
    }
    
    /* Create task to monitor link status */
    if (xTaskCreate(link_monitor_task, "LinkMon", TASK_LED_STACK_SIZE, NULL, TASK_LED_TASK_PRIORITY, &context->link_monitor_task) != pdPASS) {
        printf("[ETH] Failed to create link monitor task\r\n");
        return DRV_ETH_STATUS_ERROR;
    }
    
    printf("[ETH] Link monitor task started\r\n");
    return DRV_ETH_STATUS_OK;
}

/**
 * \brief Stop link monitoring task
 */
static drv_eth_status_t drv_eth_stop_link_monitor_impl(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    if (context->link_monitor_task != NULL) {
        vTaskDelete(context->link_monitor_task);
        context->link_monitor_task = NULL;
        printf("[ETH] Link monitor task stopped\r\n");
    }
    
