chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_send_packet_impl(const void *hw_context, const uint8_t *data, uint16_t length)
{
    ASSERT(hw_context != NULL);
    ASSERT(data != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_write(context->mac_desc, (uint8_t *)data, length);
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_receive_packet_impl(const void *hw_context, uint8_t *data, uint16_t *length)
{
    ASSERT(hw_context != NULL);
    ASSERT(data != NULL);
    ASSERT(length != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    uint32_t read_length = *length;
    int32_t result = mac_async_read(context->mac_desc, data, read_length);
    *length = (uint16_t)read_length;
    
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_check_rx_available_impl(const void *hw_context, bool *available)
{
    ASSERT(hw_context != NULL);
    ASSERT(available != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    // Check if receive flag is set (this is a simplified implementation)
    // In a more complete implementation, you would check the MAC's receive status
    *available = context->recv_flag;
    context->recv_flag = false; // Clear flag after reading
    
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_get_config_impl(const void *hw_context, drv_ethernet_config_t *config)
{
    ASSERT(hw_context != NULL);
    ASSERT(config != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    // Get MAC address from the MAC descriptor
    // This is a simplified implementation - in reality you might read from EEPROM or other storage
    uint8_t default_mac[] = {0x00, 0x04, 0x25, 0x12, 0x34, 0x56};
    memcpy(config->mac_addr, default_mac, 6);
    
    return DRV_ETH_STATUS_OK;
}